[Templates]
Count=58
[Template1]
ID=explain_basic
Title=代码解释
Content=解释这段代码的核心逻辑、输入输出、关键函数作用，用新手能懂的语言，标注易错点
Icon=
Category=基础
FunctionCategory=Explain
Series=Basic
[Template2]
ID=refactor_basic
Title=代码重构
Content=重构这段代码，遵循PEP8/行业规范，简化冗余逻辑，添加中文注释，保持功能不变
Icon=
Category=基础
FunctionCategory=Refactor
Series=Basic
[Template3]
ID=optimize_basic
Title=性能优化
Content=分析这段代码的性能瓶颈（时间/空间复杂度），给出优化方案+对比说明，保留原逻辑可读性
Icon=
Category=基础
FunctionCategory=Optimize
Series=Basic
[Template4]
ID=debug_basic
Title=调试代码
Content=请帮我调试这段代码，找出可能的bug和错误，并提供修复建议
Icon=
Category=基础
[Template5]
ID=test_basic
Title=编写测试
Content=为这段代码编写单元测试，覆盖主要功能和边界情况
Icon=
Category=基础
[Template6]
ID=document_basic
Title=添加文档
Content=为这段代码添加详细的文档注释，包括函数说明、参数说明、返回值说明和使用示例
Icon=
Category=基础
[Defaults]
Explain=explain_basic
Refactor=refactor_basic
Optimize=optimize_basic
[Template7]
ID=code_review
Title=代码审查
Content=请对这段代码进行全面审查，指出潜在问题、bug、安全隐患和改进建议
Icon=
Category=专业
[Template8]
ID=architecture_analysis
Title=架构分析
Content=请从专业的角度分析这段代码，包括架构设计、设计模式、技术选型等方面的考量
Icon=
Category=专业
[Template9]
ID=security_audit
Title=安全审计
Content=请对这段代码进行安全审计，检查是否存在SQL注入、XSS、CSRF等安全漏洞，并提供安全加固建议
Icon=
Category=专业
[Template10]
ID=performance_profiling
Title=性能分析
Content=请深入分析这段代码的性能问题，包括CPU使用、内存占用、I/O操作等，并提供详细的性能优化方案
Icon=
Category=专业
[Template11]
ID=design_pattern
Title=设计模式
Content=请分析这段代码是否适合应用设计模式，如果适合，请重构代码应用合适的设计模式，并说明原因
Icon=
Category=专业
[Template12]
ID=scalability
Title=可扩展性分析
Content=请分析这段代码的可扩展性，包括如何处理高并发、大数据量等情况，并提供扩展性改进方案
Icon=
Category=专业
[Template13]
ID=bugfix_urgent
Title=不分等着过年？
Content=现在请你扮演一位经验丰富、以严谨著称的架构师。指出现在可能存在的风险、不足或考虑不周的地方，重新审查我们刚才制定的这个 Bug 修复方案 ，请粘贴错误代码或者截图
Icon=
Category=改错
[Template14]
ID=bugfix_multiple
Title=AI海王手册
Content=请提供三种不同的修复方案。并为每种方案说明其优点、缺点和适用场景，让我来做选择，请粘贴错误代码或者截图
Icon=
Category=改错
[Template15]
ID=bugfix_research
Title=上外网看看吧
Content=我的代码遇到了一个典型问题：请你扮演网络搜索助手，在GitHub Issues / Stack Overflow等开源社区汇总常见的解决方案，并针对我的这个bug给出最优的修复建议。请粘贴错误代码或者截图
Icon=
Category=改错
[Template16]
ID=bugfix_explain
Title=给我翻译翻译
Content=请用最简单易懂的语言告诉我这个错误是什么意思？最可能是我代码中的哪部分导致的？请粘贴错误代码或者截图
Icon=
Category=改错
[Template17]
ID=bugfix_diagram
Title=无图无真相
Content=请你为我分别生成 ASCII 序列图或mermaid流程图，模拟展示错误代码的执行步骤和关键变量的变化，帮我直观地看到问题出在哪一步。请粘贴错误代码或者截图
Icon=
Category=改错
[Template18]
ID=bugfix_rules
Title=乱拳打死老师傅
Content=我的代码违反了编程基础规则导致bug，请帮我用「规则校验法」排查：
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
1. 列出代码违反的核心编程规则（比如「变量命名规范」「条件判断完整性」「资源释放规则」）；
2. 用ASCII checklist（勾选框）标注每个规则的违反情况；
3. 解释这些规则的作用，以及违反后为什么会触发bug；
4. 给出符合规则的修改思路，附带新手易记的规则口诀。请粘贴错误代码或者截图
Icon=
Category=改错
[Template19]
ID=bugfix_reverse
Title=倒反天罡
Content=从最终的这个 错误结果 / 异常状态开始，进行逆向逻辑推导。分析：在什么情况下、输入了什么样的数据、经过了怎样的操作，才会导致产生这个特定的结果？列出导致该结果的 3 种最可能的根本原因。请粘贴错误代码或者截图
Icon=
Category=改错
[Template20]
ID=bugfix_debug
Title=捉奸拿赃
Content=给我提供一个图形弹窗方案，通过步骤来一步步追溯问题来源，定位问题所在。请粘贴错误代码或者截图
Icon=
Category=改错
[Template21]
ID=bugfix_simple
Title=弱智吧
Content=请用生活中的最简单多类比来解释这个 Bug 的成因。在我不理解任何编程术语的前提下，告诉我这个问题到底在'犯什么傻'。请粘贴错误代码或者截图
Icon=
Category=改错
[Template22]
ID=bugfix_isolate
Title=拆东墙补西墙
Content=把这段代码想象成乐高积木。请告诉我哪几块积木是独立的？请帮我通过'拆除法'定位到底是哪一块积木坏了？请粘贴错误代码或者截图
Icon=
Category=改错
[Template23]
ID=bugfix_color
Title=给点color看看
Content=请给我的代码涂色。绿色是确认安全的，黄色是逻辑可疑的，红色是报错核心。请重点解释红色部分的'逻辑死结'是如何形成的。请粘贴错误代码或者截图
Icon=
Category=改错
[Template24]
ID=bugfix_minimal
Title=Word很大，你忍一下
Content=不要大改我的架构。请给出一种'微创手术'方案：只修改最少的字符（比如改个符号或加个判断），就能让整个程序恢复运行，并解释为什么这一刀最关键。请粘贴错误代码或者截图
Icon=
Category=改错
[ExpandedStates]
Count=0
[Template25]
ID=bugfix_human
Title=请说人话
Content=请提供一份双语对照表。左边是代码行，右边是对应的'人类意图'。通过对比，帮我定位哪一行有错误。请粘贴错误代码或者截图
Icon=
Category=改错
[Template26]
ID=explain_basic
Title=代码解释
Content=解释这段代码的核心逻辑、输入输出、关键函数作用，用新手能懂的语言，标注易错点
Icon=💡
Category=基础
[Template27]
ID=refactor_basic
Title=代码重构
Content=重构这段代码，遵循PEP8/行业规范，简化冗余逻辑，添加中文注释，保持功能不变
Icon=🔧
Category=基础
[Template28]
ID=optimize_basic
Title=性能优化
Content=分析这段代码的性能瓶颈（时间/空间复杂度），给出优化方案+对比说明，保留原逻辑可读性
Icon=⚡
Category=基础
[Template29]
ID=debug_basic
Title=调试代码
Content=请帮我调试这段代码，找出可能的bug和错误，并提供修复建议
Icon=
Category=基础
[Template30]
ID=test_basic
Title=编写测试
Content=为这段代码编写单元测试，覆盖主要功能和边界情况
Icon=
Category=基础
[Template31]
ID=document_basic
Title=添加文档
Content=为这段代码添加详细的文档注释，包括函数说明、参数说明、返回值说明和使用示例
Icon=
Category=基础
[Template32]
ID=code_review
Title=代码审查
Content=请对这段代码进行全面审查，指出潜在问题、bug、安全隐患和改进建议
Icon=🔍
Category=专业
[Template33]
ID=architecture_analysis
Title=架构分析
Content=请从专业的角度分析这段代码，包括架构设计、设计模式、技术选型等方面的考量
Icon=🏗️
Category=专业
[Template34]
ID=security_audit
Title=安全审计
Content=请对这段代码进行安全审计，检查是否存在SQL注入、XSS、CSRF等安全漏洞，并提供安全加固建议
Icon=
Category=专业
[Template35]
ID=performance_profiling
Title=性能分析
Content=请深入分析这段代码的性能问题，包括CPU使用、内存占用、I/O操作等，并提供详细的性能优化方案
Icon=
Category=专业
[Template36]
ID=design_pattern
Title=设计模式
Content=请分析这段代码是否适合应用设计模式，如果适合，请重构代码应用合适的设计模式，并说明原因
Icon=
Category=专业
[Template37]
ID=scalability
Title=可扩展性分析
Content=请分析这段代码的可扩展性，包括如何处理高并发、大数据量等情况，并提供扩展性改进方案
Icon=
Category=专业
[Template38]
ID=bugfix_urgent
Title=不分等着过年？
Content=现在请你扮演一位经验丰富、以严谨著称的架构师。指出现在可能存在的风险、不足或考虑不周的地方，重新审查我们刚才制定的这个 Bug 修复方案 ，请粘贴错误代码或者截图
Icon=
Category=改错
[Template39]
ID=bugfix_multiple
Title=AI海王手册
Content=请提供三种不同的修复方案。并为每种方案说明其优点、缺点和适用场景，让我来做选择，请粘贴错误代码或者截图
Icon=
Category=改错
[Template40]
ID=bugfix_research
Title=上外网看看吧
Content=我的代码遇到了一个典型问题：请你扮演网络搜索助手，在GitHub Issues / Stack Overflow等开源社区汇总常见的解决方案，并针对我的这个bug给出最优的修复建议。请粘贴错误代码或者截图
Icon=
Category=改错
[Template41]
ID=bugfix_explain
Title=给我翻译翻译
Content=请用最简单易懂的语言告诉我这个错误是什么意思？最可能是我代码中的哪部分导致的？请粘贴错误代码或者截图
Icon=
Category=改错
[Template42]
ID=bugfix_diagram
Title=无图无真相
Content=请你为我分别生成 ASCII 序列图或mermaid流程图，模拟展示错误代码的执行步骤和关键变量的变化，帮我直观地看到问题出在哪一步。请粘贴错误代码或者截图
Icon=
Category=改错
[Template43]
ID=bugfix_rules
Title=乱拳打死老师傅
Content=我的代码违反了编程基础规则导致bug，请帮我用「规则校验法」排查：
Icon=
Category=改错
[Template44]
ID=bugfix_reverse
Title=倒反天罡
Content=从最终的这个 错误结果 / 异常状态开始，进行逆向逻辑推导。分析：在什么情况下、输入了什么样的数据、经过了怎样的操作，才会导致产生这个特定的结果？列出导致该结果的 3 种最可能的根本原因。请粘贴错误代码或者截图
Icon=
Category=改错
[Template45]
ID=bugfix_debug
Title=捉奸拿赃
Content=给我提供一个图形弹窗方案，通过步骤来一步步追溯问题来源，定位问题所在。请粘贴错误代码或者截图
Icon=
Category=改错
[Template46]
ID=bugfix_simple
Title=弱智吧
Content=请用生活中的最简单多类比来解释这个 Bug 的成因。在我不理解任何编程术语的前提下，告诉我这个问题到底在'犯什么傻'。请粘贴错误代码或者截图
Icon=
Category=改错
[Template47]
ID=bugfix_isolate
Title=拆东墙补西墙
Content=把这段代码想象成乐高积木。请告诉我哪几块积木是独立的？请帮我通过'拆除法'定位到底是哪一块积木坏了？请粘贴错误代码或者截图
Icon=
Category=改错
[Template48]
ID=bugfix_color
Title=给点color看看
Content=请给我的代码涂色。绿色是确认安全的，黄色是逻辑可疑的，红色是报错核心。请重点解释红色部分的'逻辑死结'是如何形成的。请粘贴错误代码或者截图
Icon=
Category=改错
[Template49]
ID=bugfix_minimal
Title=Word很大，你忍一下
Content=不要大改我的架构。请给出一种'微创手术'方案：只修改最少的字符（比如改个符号或加个判断），就能让整个程序恢复运行，并解释为什么这一刀最关键。请粘贴错误代码或者截图
Icon=
Category=改错
[Template50]
ID=bugfix_human
Title=请说人话
Content=请提供一份双语对照表。左边是代码行，右边是对应的'人类意图'。通过对比，帮我定位哪一行有错误。请粘贴错误代码或者截图
Icon=
Category=改错
[Template51]
ID=teach_code
Title=教学解释
Content=请用教学的方式解释这段代码，适合初学者理解，包括基本概念、工作原理和实际应用场景
Icon=📚
Category=教学
[Template52]
ID=beginner_friendly
Title=新手友好
Content=请用最简单的语言解释这段代码，适合完全没有编程基础的人理解，使用生活中的例子来类比
Icon=
Category=教学
[Template53]
ID=step_by_step
Title=逐步讲解
Content=请逐步讲解这段代码的执行流程，每一步都详细说明，帮助理解代码的运行过程
Icon=
Category=教学
[Template54]
ID=concept_explanation
Title=概念解释
Content=请解释这段代码中涉及的核心概念和知识点，包括相关的理论基础和实际应用
Icon=
Category=教学
[Template55]
ID=learning_path
Title=学习路径
Content=请为这段代码提供学习路径建议，包括需要掌握的前置知识、学习顺序和推荐的学习资源
Icon=
Category=教学
[Template56]
ID=practice_exercise
Title=练习建议
Content=请基于这段代码提供相关的练习题目和项目建议，帮助巩固所学知识
Icon=
Category=教学
[Template57]
ID=template_275926265
Title=1
Content=1
Icon=
Category=1
[Template58]
ID=template_275935734
Title=2
Content=2
Icon=
Category=1
